

#ifndef __DMAC_CRYPTO_WEP_H__
#define __DMAC_CRYPTO_WEP_H__

#ifdef __cplusplus
#if __cplusplus
extern "C" {
#endif
#endif

#ifdef _PRE_WLAN_FEATURE_SOFT_CRYPTO

/*****************************************************************************
  1 其他头文件包含
*****************************************************************************/
#include "dmac_crypto_comm.h"

#undef  THIS_FILE_ID
#define THIS_FILE_ID OAM_FILE_ID_DMAC_CRYPTO_WEP_H
/*****************************************************************************
  2 宏定义
*****************************************************************************/
#define WEP_KEY_LEN     13
#define WEP_IV_LEN      4
#define WEP_ICV_LEN     4

/*****************************************************************************
  3 枚举定义
*****************************************************************************/

/*****************************************************************************
  4 全局变量声明
*****************************************************************************/


/*****************************************************************************
  5 消息头定义
*****************************************************************************/


/*****************************************************************************
  6 消息定义
*****************************************************************************/


/*****************************************************************************
  7 STRUCT定义
*****************************************************************************/
struct wep_data
{
    oal_uint32 ul_iv;
    oal_uint8 auc_key[WEP_KEY_LEN + 1];
    oal_uint8 uc_key_len;
    oal_uint8 uc_key_idx;
};

/*****************************************************************************
  8 UNION定义
*****************************************************************************/


/*****************************************************************************
  9 OTHERS定义
*****************************************************************************/


/*****************************************************************************
  10 函数声明
*****************************************************************************/
oal_int32 dmac_ieee80211_wep_encrypt(oal_uint8 *puc_mac_hdr_addr,
                                                    oal_uint8 uc_mac_header_len,
                                                    oal_uint8 *puc_mac_body_addr,
                                                    oal_uint16 us_mac_frame_len,
                                                    oal_uint8 uc_tx_key_idx,
                                                    oal_uint32 ul_tx_key_len,
                                                    oal_uint8 *puc_tx_key,
                                                    oal_uint32* pul_iv);
oal_int32 dmac_ieee80211_wep_decrypt(oal_uint8 *puc_mac_hdr_addr,
                                                    oal_uint8 uc_mac_header_len,
                                                    oal_uint8 *puc_mac_body_addr,
                                                    oal_uint16 us_mac_frame_len,
                                                    oal_uint8 uc_tx_key_idx,
                                                    oal_uint32 ul_tx_key_len,
                                                    oal_uint8 *puc_tx_key,
                                                    hal_rx_status_enum_uint8 *puc_rx_status);

#endif /* _PRE_WLAN_FEATURE_SOFT_CRYPTO */

#ifdef __cplusplus
    #if __cplusplus
        }
    #endif
#endif

#endif /* #ifndef __DMAC_CRYPTO_WEP_H__ */
